public class Main {

  // Коллекции (упорядоченная == есть индексы):
  // - String (строка) - только символы, неизменяемая, упорядоченная.
  // - array[] (массив) - любые объекты, постоянный размер, упорядоченная.
  // - List (список) - любые классы, переменный размер, упорядоченная.
  // - Set (множество) - любые классы, переменный размер, неупорядоченная,
  //   только уникальные элементы.
  // - Map (словарь) - любые классы, переменный размер, неупорядоченная, пары ключ-значение,
  //   только уникальные ключи.
  // Размер: size (когда меняется) и length (когда не меняется)
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
