public class Main2 {
    public static void main(String[] args) {
        System.out.println("Temperature convertor");
        //Сделать конвертор для расчета температур в градусах Цельсия, Фаренгейта и Кельвина.
//        Постановка задачи:
//        - Что будем вводить?  - целое число - это температура в Цельсии, - в какой градус конвертирум
//          1- это конвернируем в Фаренгейт, 2 - это конвертируем в Кельвин
//        - Что на входе? - температура и выбор пользователя
//        - Какие данные на входе? - новая температура
//        - Что надо сделать? -
//        - Что будет на выходе из программы? -
//        - Ключевой алгоритм? - swich ... case
        // + 273 - это Кельвин, С = 5*(F-32)/9
//        - Какой будет интерфейс взаимодействия с пользователем? - кратко описать
        // Введите температуру в градусах Цельсия
        // В какие градусы будем конвертировать 1 - Фаренгейт, 2 - Кельвин



    }
}




















/*
    ArrayList<String> latAlphabet = new ArrayList<>(); //инициализация

        System.out.println();

                // заполняем в цикле
                for ( int i = 0 ; i < 26 ; i++ ) {
        latAlphabet.add(String.valueOf((char)(i + 65)));
        }

        System.out.println(latAlphabet); // печать полученного списка

 */