public class Main {
    public static void main(String[] args) {
        System.out.println("Расчет средней стоимости поездки");
        //    Написать программу для вычисления средней стомости поездки
        //    по транспортному проездному.
        //    Попросить пользователя ввести стоимость проездного на месяц
        //    и количество рабочих дней.
        //    Считая, что в рабочий день в среднем две поездки,
        //    и 1.5 поездки в выходной,
        //    посчитать и округлить общее число поездок в месяц
        //    и посчитать среднюю стоимость одной поездки по проездному.

            float f = 9876543210F;

    }
}