public class Main {
    public static void main(String[] args) {
        System.out.println("Arrays practicum");

//        ### Задача 1:
//        Определить массив для хранения 10 чисел.
//        Заполнить массив целыми числами кратными 10 от 10 до 100.
//        Распечатать элементы массива в виде: Element at index 0: значение элемента
        // 10, 20, 30, 40 ... , 100
        // Что на входе - ничего, надо заполнить массив
        // На выходе - 10 раз напечатано
        // Ключевой алгоритм - цикл

        int[] numbers = new int[10]; // мы объявили массив на 10 элеменов, целые числа


    }
}