public class Main2 {
    public static void main(String[] args) {
        System.out.println("Arrays practicum - continue");

    // Задача 1. Создать массив, в котором храняться названия дней недели. Вывести на печать выходные дни.

        String[] days = new String[7];
        days = new String[]{"M","T", "W", "Th","F","St","Su" }; // задаем массив

        System.out.println(days[5]);
        System.out.println(days[6]);

    }
}