public class Homework32 {

  // Программисты, как вы уже знаете, постоянно учатся, а в общении между собой используют весьма
  // специфический язык. Чтобы систематизировать ваш пополняющийся профессиональный лексикон, мы
  // придумали эту задачу.
  // Напишите программу создания небольшого словаря сленговых программерских выражений, чтобы она
  // потом по запросу возвращала значения из этого словаря.

  // Файл `dict.txt`
  // В первой строке задано одно целое число `n` — количество слов в словаре.
  // В следующих `n` строках записаны слова и их определения, разделенные двоеточием и символом
  // пробела.
  // 5
  // Змея: язык программирования Python
  // Баг: от англ. bug — жучок, клоп, ошибка в программе
  // Конфа: конференция
  // Костыль: код, который нужен, чтобы исправить несовершенство ранее написанного кода
  // Бета: бета-версия, приложение на стадии публичного тестирования

  // Ввод с клавиатуры
  // В первой строке записано целое число `m` — количество поисковых слов, чье определение нужно
  // вывести.
  // В следующих `m` строках записаны сами слова, по одному на строке.
  // 3
  // Змея
  // Жаба
  // костыль

  // Для каждого слова, независимо от регистра символов, если оно присутствует в словаре,
  // необходимо вывести на экран его определение.
  //
  // Если слова в словаре нет, программа должна вывести "Не найдено", без кавычек.
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
