public class Main {
    public static void main(String[] args) {
        System.out.println("Methods and arrays example");
        //Написать метод, который создает копию исходного массива
        //и в ней меняяет местами максимальный и минимальный элементы

        int[] newArray = new int[10];

    }
}