public class Main {

  // Термин "поток" появлялся в наших занятиях в трёх независимых местах:
  // - Поток ввода (input stream) и поток вывода (output stream)
  //   Может быть как стандартный (клавиатура и экран), так и модифицированный (файлы)
  // - Потоки данных - стримы - (data stream)
  //   класс Stream и все его операторы (промежуточные и терминальные)
  // - Потоки выполнения команды - треды - (thread)
  //   многопоточность, класс Thread
  public static void main(String[] args) {
    System.out.println("Hello world!");
  }
}
