# План занятия № 19, 11.04.2023:

## 1. Обсуждение домашнего задания
Задача 1.
Написать метод, определяющий максимум из трех натуральных чисел.
Метод должен быть защищен от ввода отрицательных чисел.

Где проверять ввод отрицательных чисел - перед вызовом метода? - или в самом методе?
Метод возвращает максимум из 3-х чисел? Или он void?

Задача 2.
Написать метод, который находит площадь круга для любого заданного радиуса.
Метод должен быть защищен от ввода отрицательного числа и выводить
результат с точностью до 3-х знаков после десятичного разделителя.

Как выглядит строка для печати рез-та с 3-мя знаками после запятой?

Есть ли вопросы? Были ли трудности?

## Написание приложения "Калькулятор"
нам будут полезны:
- метод считывает имя (строку) и защищен от ввода строки в виде чисел 
с помощью регулярного выражения
- метод считывает целое число (строку) и защищен от ввода строки из букв 
с помощью регулярного выражения
### Java Regular Expressions
подробнее здесь: [https://www.w3schools.com/java/java_regex.asp ](https://www.w3schools.com/java/java_regex.asp)

## Методы - продолжение
Передадим в метод массив. Пример - поиск мин/макс элемента массива.
Метод должен вернуть индекс минимального/максимального элемента массива.
По этому индексу мы однозначно определим сам элемент.

## 2. Новая тема
Операторы break, continue - примеры использования.
Парадигма структурного программирования - теорема Бёма-Якопини.
см. раздел Теория

## 3. Практикум
### Задание 1
Что делает данный код? (пробуем выполнить у себя)
`for (int i = 0; i < 10; i++) {
if (i == 4) {
continue;
}
System.out.println(i);
}
`
### Задание 2
Что делает данный код? (пробуем выполнить у себя)
`int i = 0;
while (i < 10) {
System.out.println(i);
i++;
if (i == 5) {
break;
}
}`

### Задача 1.
Пользователь 10 раз вводит целые числа с клавиатуры,
при вводе отрицательного числа ввод чисел необходимо прекратить.

### Задача 2.
Дано n, вводится пользователем с клавиатуры. Написать программу, которая вычисляет
сумму S = 2 + 4 + … + n.

### Задача 3.
На вход программе подается натуральное число n. Напишите программу, которая выводит
числа от 1 до n включительно за исключением чисел от 5 до 19 включительно.

### Задача 4.
Имеется массив результатов измерений скорости ветра с помощью датчика на буе
с частотой раз в 5 секунд. Из-за качаний самого буя на волнении часть измерений
заведомо неверные, сила ветра более 17 м/с.
Найдите среднюю скорость ветра за период наблюдений.
5.2, 5.3, 5.1, 5.5, 17.1, 6.2, 5.8, 5.6, 5.9, 17.3, 5.4, 5.5, 5.4, 17.0,
5.7, 5.8, 5.5, 5.0, 5.3, 17.5, 5.4, 5.6, 5.8, 6.2, 17.2, 5.0, 4.8,5.6, 5.9



