# План занятия № 20, 12.04.2023:

## 1. Обсуждение домашнего задания
Задача 1.
Вводится натуральное число n с клавиатуры. Подсчитать сумму всех
натуральных чисел меньших n, за исключением чисел, кратных числу 3.

Задача на прорпуск при суммировании кратных 3 чисел, меньших введенному числу n.

Алгоритим:
1. На входе - натуральное число n, вводится с клавиатуры пользователем, int num
2. 1 + 2 + (3) + 4 + 5 + (6) + 7 + 8 + (9) + ... 
3. используем цикл, который будет суммировать все эти числа
4. надо использовать условие, что число делится на 3 без остатка, 6 % 3 = 0 потому 
что 6 разделилось на 3
5. continue позволяет пропустить такт цикла
Шаг 1 - спросить пользователя число n
Шаг 2 - запустить цикл
Шаг 3 - внутри цикла проверять делимость на 3 без остатка(!) и пропускать этот такт цикла

Задача 2.
Задача про поиск "счастливого пельменя".
Хозяйка налепила для гостей 30 пельменей. В один из пельменей она положила монету,
которая увеличивает вес пельменя на 15 грамм.
Напишите программу, которая ищет счастливый пельмень.

Алгоритм: 
Шаг 1: надо задать массив на 30 элементов, элементы массива - это ВЕСа пельмений
будем использовать датчик случайных чисел, int, 20 или 30 грамм - такой вес будем задумывать
Шаг 2: задумать одно случайное число в интервале от 0 до 29 - это и будет ИНДЕКС (номер) счастливого пельменя
для примера - n
Шаг 3: вес n-го пельменя надо увеличить на 15 грамм
dumplings[n] = dumplings[n] + 15;
Шаг 4: надо пройти циклом по элементам массива и оборвать его в тот момент, когда вес найденного 
пельменя будет большим. Цикл for , внутри условие, сранвниваем вес элементов, запомнить индекс в этот момент.

Есть ли вопросы? Были ли трудности?

## 2. Новая тема - Exceptions, try ... catch
см. раздел Теория

## 3. Практикум 
### Примеры 
1. Выход за пределы длины массива;
       `  int[] myNumbers = {1, 2, 3};
       try {
       System.out.println(myNumbers[10]);
       } catch (Exception e) {
       System.out.println("Вы обратились к элементу массива, индекс которого больше, чем длина массива.");
       };`
2. Калькулятор деления a на b, оформляем бесконечный цикл, защита от деления на 0
   и ввода символов вместо чисел;
3. Расчет периметра прямоугольника, защита от ввода символов вместо числа
   и ввода отрицательных чисел;
4. Использование debugger на примере задачи про НОД.
   Задача: найти наибольший общий делитель (НОД) двух целых чисел a и b.
   Примеры:
   15 и 20: НОД = 5
   15 и 60: НОД = 15
   17 и 23: НОД = 1
   24 и 40: НОД = 8
   6 и 18: НОД = 6
   4 и 12: НОД = 4






