package homework_61;

public class Main {

  // Создайте список учеников с баллами.
  //
  // Попросите пользователя ввести минимальный проходной балл.
  //
  // Выведите список учеников согласно следующим условиям:
  // - каждый ученик выведен в отдельной строке
  // - баллы каждого ученика выше минимального проходного
  // - ученики отсортированы по убыванию среднего балла
  // - в списке не больше 10 учеников (извините, конкурс)
  //
  // Для обработки и вывода результата используйте потоки (`Stream`).
  //
  // ## Примечание
  // Cортировка потока выполняется при помощи промежуточного метода `sorted(Comparator<? super T> comparator)`.
  // В качестве компаратора используйте лямбда-функцию.
  public static void main(String[] args) {

  }
}
