public class Main {

  public static void main(String[] args) {
    // Тестирование
    // - юнит-тесты (модульные тесты) - тестируются отдельные методы - пишет разработчик
    // - интеграционные тесты - тестирование взаимодействия классов или сервисов - пишет разработчик
    // - функциональные тесты - тестирование сценария использования - производит тестировщик

    // - нагрузочные тесты - тестирование производительности - обычно производит тестировщик

    // - приёмочные тесты - тестирование заказчиком - производит клиент или product manager

    // - TDD (test driven development) - сначала тесты, потом код
  }
}
