public class Main {

  // git - программа, система контроля версий.
  // Сама по себе ничего не знает про ваши облачные хранилища
  // и может работать даже без доступа в Интернет.

  // Git работает с репозиториями - папками, в которых следит за историей и версиями файлов.
  // В git могут существовать разные параллельные версии одного и того же репозитория - ветки.
  // С ними вы познакомитесь позже, в нашем случае вся работа будет происходить в одной основной
  // ветке - main (в старых версиях - master).

  // Эти репозитории можно хранить в облачном хранилище. Самое популярное такое хранилище - GitHub.
  // Это надёжнее, и так гораздо легче организовать совместную работу над проектом.

  // На сайте GitHub создаём ПУСТОЙ репозиторий, и подключаем его как remote к нашему существующему,
  // созданному при помощи IntelliJ Idea.
  // Любая другая последовательность действий может привести к проблеме, которую будет сложно
  // решить.
}