public class Main1 {
    public static void main(String[] args) {
        System.out.println("Perimeter of rectangle");
//        Напишите программу, которая запрашивет N имен учащихся группы и выводит список имен в столбик.
//        N запрашивется с клавиатуры, имена вносятся в массив для последующей сортировки по алфавиту.
//        Программа должна быть защищена от ввода чисел вместо имен.

    }
}